learningrails_9/app/controllers/links_controller.rb

SELECT * FROM "links"
---
  def index
    @links = Link.all

SELECT * FROM "links" WHERE ("links"."id" = 1)
---
  def show
    @link = Link.find(params[:id])

SELECT * FROM "links" WHERE ("links"."id" = 1)
---
  def edit
    @link = Link.find(params[:id])

INSERT INTO "links" ("updated_at", "title", "url", "description", "created_at") VALUES('2009-07-24 00:42:39', 'Building Web Apps', 'http://www.buildingwebapps.com', 'Nuestro recurso favorito', '2009-07-24 00:42:39')
---
  def create
    @link = Link.new(params[:link])

    respond_to do |format|
      if @link.save