learningrails_9/app/controllers/messages_controller.rb

SELECT * FROM "messages"
---
  def index
    @messages = Message.all

SELECT * FROM "messages" WHERE ("messages"."id" = 1)
---
  def show
    @message = Message.find(params[:id])

INSERT INTO "messages" ("name", "company", "updated_at", "body", "subject", "phone", "email", "created_at") VALUES('juan rulfo', 'Bw', '2009-07-27 18:28:57', 'este es el cuerpo del mensaje', 'este es el encabezado', '123 456 7890', 'juano@rulfo.com', '2009-07-27 18:28:57')
---
  def create
    @message = Message.new(params[:message])

    respond_to do |format|
      if @message.save