learningrails_9/app/controllers/users_controller.rb

  def index
    @users = User.find(:all)
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1
DELETE FROM "users" WHERE "id" = 3

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def update
    @user = User.find(params[:id])

    if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
UPDATE "users" SET "login" = 'alexi', "crypted_password" = 'fde6db8dbb24209619895ff31b1139dbdc6c7dd9', "updated_at" = '2009-07-07 20:34:21' WHERE "id" = 4

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO "users" ("salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('89f85a279678d4891d0a9da00069322b7de1d793', '2009-07-07 03:32:19', 'd5c30b3f2ef1bc224d3ce55171c5169630eda45f', NULL, NULL, 'sergio', 'sergio@telactiv.com', '2009-07-07 03:32:19')